### PAIR PROGRAMMING - LIMPIEZA 2

In [1]:
import pandas as pd

pd.options.display.max_columns = None

Antes de seguir, recordamos las preguntas que nos planteamos al principio del pair programming para dirigir nuestro an√°lisis.

1. La edad, el trabajo, el estado civil, la educaci√≥n, la situaci√≥n de deuda y la forma de contacto pueden influir en la probabilidad de que un cliente acepte la oferta.
   
2. El n√∫mero de veces que se ha contactado a un cliente en el pasado (campo campaign), el n√∫mero de d√≠as que han pasado desde el √∫ltimo contacto (campo pdays), y el resultado de la campa√±a anterior (campo poutcome) pueden afectar la respuesta del cliente a una nueva oferta.

3. Las variables econ√≥micas (tales como el √≠ndice de precios al consumidor (cons.price.idx), la tasa de variaci√≥n del empleo (emp.var.rate), etc.) pueden influir en la probabilidad de que un cliente acepte la oferta.

4. Los clientes que ya tienen una hipoteca (housing) o un pr√©stamo (loan) pueden ser menos propensos a aceptar una nueva oferta, ya que podr√≠an estar limitados financieramente.

Por lo tanto, en este ejercicio nos queda por limpiar algunas columnas del conjunto de datos, as√≠ que manos a la obra. Vamos a ver que podemos hacer para cada una de las columnas y os dejaremos algunas pistas üòâ. Para esto trabajaremos con el fichero generado en Limpieza I.

1. Columnas loan, housing y default: estas columnas contienen valores √∫nicos de 0 y 1. Esto puede parecer poco intuitivo a la hora de la extracci√≥n de conclusiones y en las visualizaciones. El objetivo de este ejercicio es que cambies los valores n√∫mericos por "Si" y "No". A que corresponde cada uno de los valores lo ten√©is en el pair de Limpieza I.

In [33]:
df = pd.read_csv('../ejercicio1/datos/bank_additional_edit.csv', index_col = 0)
df.head(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
1,57,services,married,high.school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
2,37,services,married,high.school,0.0,1.0,0.0,telephone,226,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"

In [34]:
df['loan'].dtypes #SIEMPREE! Asegurarnos con qu√© tipo de dato estamos trabajando

dtype('float64')

In [35]:
mapa = {0.0: "No", 1.0: "Si"}

In [36]:
df['loan'] = df['loan'].map(mapa, na_action = None)

In [38]:
df['default'] = df['default'].map(mapa, na_action = None)

In [39]:
df['housing'] = df['housing'].map(mapa, na_action = None)

In [40]:
df['loan'].unique()

array(['No', 'Si', nan], dtype=object)

In [41]:
df['default'].unique()

array(['No', nan, 'Si'], dtype=object)

In [42]:
df['housing'].unique()

array(['No', 'Si', nan], dtype=object)

In [44]:
df.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,married,basic.4y,No,No,No,telephone,261,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
1,57,services,married,high.school,NaN,No,No,telephone,149,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"

2. Para la columna de education, si nos fijamos en sus valores √∫nicos veremos que tenemos puntos. El objetivo de este ejercicio es que quit√©is los puntos de esos valores y los reemplac√©is por espacios.

In [45]:
df['education'].unique()

array(['basic.4y', 'high.school', 'basic.6y', 'basic.9y',
       'professional.course', nan, 'university.degree', 'illiterate'],
      dtype=object)

In [46]:
df['education'] = df['education'].str.replace(".", " ")

/tmp/ipykernel_13120/1938234822.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['education'] = df['education'].str.replace(".", " ")

In [47]:
df['education'].unique()

array(['basic 4y', 'high school', 'basic 6y', 'basic 9y',
       'professional course', nan, 'university degree', 'illiterate'],
      dtype=object)

3. Para la columna job, hay un valor √∫nico que esta abreviado (admin.), cambiad la abreviatura por el nombre completo.

In [48]:
df['job'].unique()

array(['housemaid', 'services', 'admin.', 'blue-collar', 'technician',
       'retired', 'management', 'unemployed', 'self-employed', nan,
       'entrepreneur', 'student'], dtype=object)

In [49]:
df['job'] = df['job'].str.replace("admin.", "administrative")

/tmp/ipykernel_13120/1688190025.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['job'] = df['job'].str.replace("admin.", "administrative")

In [50]:
df['job'].unique()

array(['housemaid', 'services', 'administrative', 'blue-collar',
       'technician', 'retired', 'management', 'unemployed',
       'self-employed', nan, 'entrepreneur', 'student'], dtype=object)

4. La columna month_day_week tiene una lista que contiene informaci√≥n muy diferente. El objetivo de este ejercicio es separar esta columna en dos nuevas, donde tengamos los meses en una columna y los d√≠as de la semana en otra.

In [51]:
df.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,married,basic 4y,No,No,No,telephone,261,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"
1,57,services,married,high school,NaN,No,No,telephone,149,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']"

In [52]:
df['month_day_week'].unique()

array(["['may', 'mon']", "['may', 'tue']", "['may', 'wed']",
       "['may', 'thu']", "['may', 'fri']", "['jun', 'mon']",
       "['jun', 'tue']", "['jun', 'wed']", "['jun', 'thu']",
       "['jun', 'fri']", "['jul', 'tue']", "['jul', 'wed']",
       "['jul', 'thu']", "['jul', 'fri']", "['jul', 'mon']",
       "['aug', 'mon']", "['aug', 'tue']", "['aug', 'wed']",
       "['aug', 'thu']", "['aug', 'fri']", "['oct', 'fri']",
       "['oct', 'mon']", "['oct', 'tue']", "['oct', 'wed']",
       "['oct', 'thu']", "['nov', 'mon']", "['nov', 'tue']",
       "['nov', 'wed']", "['nov', 'thu']", "['nov', 'fri']",
       "['dec', 'mon']", "['dec', 'wed']", "['dec', 'thu']",
       "['dec', 'fri']", "['dec', 'tue']", "['mar', 'mon']",
       "['mar', 'tue']", "['mar', 'wed']", "['mar', 'thu']",
       "['mar', 'fri']", "['apr', 'wed']", "['apr', 'thu']",
       "['apr', 'fri']", "['apr', 'mon']", "['apr', 'tue']",
       "['sep', 'tue']", "['sep', 'wed']", "['sep', 'thu']",
       "['sep', 'fri']", "['sep', 'mon']"], dtype=object)

In [53]:
df[['month','day_week']] = df['month_day_week'].str.split(",", expand = True).iloc[:, 0:2]

In [55]:
df['month'] = df['month'].str.replace("[", "")

/tmp/ipykernel_13120/3169786798.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['month'] = df['month'].str.replace("[", "")

In [56]:
df['day_week'] = df['day_week'].str.replace("]", "")

/tmp/ipykernel_13120/2421005210.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['day_week'] = df['day_week'].str.replace("]", "")

In [59]:
df.sample(5)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day_week
16992,50,management,married,university degree,No,Si,No,cellular,161,2,999,0,nonexistent,1.4,93.918,-42.7,4.962,5228.1,no,"['jul', 'thu']",'jul','thu'
29047,41,blue-collar,married,professional course,NaN,Si,No,cellular,74,2,999,1,failure,-1.8,93.075,-47.1,1.405,5099.1,no,"['apr', 'fri']",'apr','fri'
11329,42,services,divorced,high school,NaN,No,No,telephone,111,2,999,0,nonexistent,1.4,94.465,-41.8,4.961,5228.1,no,"['jun', 'thu']",'jun','thu'
9197,40,administrative,single,high school,No,No,No,telephone,97,1,999,0,nonexistent,1.4,94.465,-41.8,4.967,5228.1,no,"['jun', 'fri']",'jun','fri'
40679,37,administrative,single,university degree,No,No,No,cellular,209,1,3,4,success,-1.1,94.199,-37.5,0.879,4963.6,yes,"['sep', 'thu']",'sep','thu'

5. Guarda el csv con las columnas limpias para seguir trabajando con este dataframe limpio.

In [61]:
df.to_csv('datos/bank_additional_edit2.csv')